In [3]:
import pandas as pd
Location = "datasets/axisdata.csv"
df = pd.read_csv(Location)
df.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

In [3]:
df['Cars Sold'].mean()

3.9229229229229228

In [4]:
df['Cars Sold'].max()

7

In [5]:
df['Cars Sold'].min()

1

In [6]:
pd.pivot_table(df, values=["Cars Sold"], index=["Gender"])

        Cars Sold
Gender
F        3.760736
M        4.078431

In [7]:
df[df["Cars Sold"]>3]["Hours Worked"].mean()

34.740237691001695

In [9]:
df["Years Experience"].mean()

3.026026026026026

In [10]:
df[df["Cars Sold"]>3]["Years Experience"].mean()

3.0492359932088284

In [11]:
pd.pivot_table(df, values=["Cars Sold"], index=["SalesTraining"])

               Cars Sold
SalesTraining
N               3.573850
Y               4.168942

In [6]:
pd.pivot_table(df, values=["Years Experience"], index=["SalesTraining"])

               Years Experience
SalesTraining
N                      3.055690
Y                      3.005119

In [7]:
pd.pivot_table(df, values=["Hours Worked", "Cars Sold", "Years Experience"], index=["Gender","SalesTraining"])

                      Cars Sold  Hours Worked  Years Experience
Gender SalesTraining
F      N               3.514151     33.424528          3.033019
       Y               3.949458     33.898917          3.061372
M      N               3.636816     33.527363          3.079602
       Y               4.365696     33.912621          2.954693